case-executed/system/yPlusz8
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

// https://cpp.openfoam.org/v11/classFoam_1_1sampledSets_1_1lineUniform.html
// https://cpp.openfoam.org/v11/classFoam_1_1sampledSets_1_1lineCell.html
// https://cpp.openfoam.org/v11/classFoam_1_1sampledSets_1_1lineFace.html
// https://cpp.openfoam.org/v11/classFoam_1_1sampledSets_1_1lineCellFace.html

#include "$FOAM_CASE/system/globalDefs"

start   (-0.001    0.0  $myLhEt);
end     ($myDp     0.0  $myLhEt);

fields  (yPlus);
//fields  (U);
//fields          (U p);


// graphUniform   lineUniform
// graphCell      lineCell
// graphFace      lineFace
// graphCellFace  lineCellFace

setConfig
{
    type    lineFace;   // lineUniform  lineCell  lineFace   lineCellFace
    // v1812:   type    face;   // uniform, midPoint, face, midPointAndFace
    axis    x;  // x, y, z, xyz, distance
    //nPoints 11;
    //nPoints $myNxp1; // face does not requires nPoints, uniform requires nPoints
}


//#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
type            sets; // 
libs            ("libsampling.so");

writeControl    writeTime;
//writeControl    timeStep;

interpolationScheme cellPoint; // cell, cellPoint, cellPointFace

// gnuplot format is giving problems in openfoam 11
//setFormat   gnuplot; // raw, gnuplot, xmgr, jplot
setFormat   raw;

//#includeEtc "caseDicts/postProcessing/graphs/graphFace.cfg"

sets
(
    line
    {
        $setConfig;
        start $start;
        end   $end;
    }
);

// ************************************************************************* //
